<?php
/*
	热侧进口温度 -> T_1_i
	热侧出口温度 -> T_1_o
	热侧流量     -> W_1
	热侧压降     -> delta_p_1
	冷侧进口温度 -> T_2_i
	冷侧出口温度 -> T_2_o
	冷侧流量	 -> W_2
	冷侧压降	 -> delta_p_2
	热负荷       -> Q
 */
//判断参数是否有效
function input($T_1_i,$T_1_o,$W_1,$delta_p_1,$T_2_i,$T_2_o,$W_2,$delta_p_2,$Q)
{
	echo 
	"热侧进口温度" . $T_1_i . "<br>" . 
	"热侧出口温度" . $T_1_o . "<br>" . 
	"热侧流量" . $W_1 . "<br>" . 
	"热侧压降" . $delta_p_1 . "<br>" . 
	"冷侧进口温度" . $T_2_i . "<br>" . 
	"冷侧出口温度" . $T_2_o . "<br>" . 
	"冷侧流量" . $W_2 . "<br>" . 
	"冷侧压降" . $delta_p_2 . "<br>" . 
	"热负荷" . $Q . "<br>";
}
function ec($a)
{
	echo "$a<br >";
}

//通过接口流速的大小来进行筛选，提取接口流速在1到5
function filter($W_1,$W_2,$roll1,$roll2)
{
	$A_st = array();
	$A_st[0] = pi()*(32/2)*(32/2)/1000000;
	$A_st[1] = pi()*(50/2)*(50/2)/1000000;
	$A_st[2] = pi()*(65/2)*(65/2)/1000000;
	$A_st[3] = pi()*(80/2)*(80/2)/1000000;
	$A_st[4] = pi()*(100/2)*(100/2)/1000000;
	$A_st[5] = pi()*(150/2)*(150/2)/1000000;
	$A_st[6] = pi()*(200/2)*(200/2)/1000000;
	$A_st[7] = pi()*(250/2)*(250/2)/1000000;
	$A_st[8] = pi()*(300/2)*(300/2)/1000000;
	$A_st[9] = pi()*(350/2)*(350/2)/1000000;
	$A_st[10] = pi()*(400/2)*(400/2)/1000000;
	$A_st[11] = pi()*(450/2)*(450/2)/1000000;
	$A_st[12] = pi()*(500/2)*(500/2)/1000000;
	$A_st[13] = pi()*(600/2)*(600/2)/1000000;

	$j = 0;
	$k = 0;
	if ($W_1 >= $W_2) {
		for ($i=0; $i < 14; $i++) { 
			$R = $W_1 / $roll1 / $A_st[$i];
			
			if ($R >= 1 && $R <= 5) {
				$Arr[$j] = $R;
				$C_D[$j] = sqrt($A_st[$i]*1000000/pi()*4);
				$j++; 
			} else {
				$error[$k] = $R;
				$k++;
			}
		}
	} else {
		for ($i=0; $i < 14; $i++) { 
			$R = $W_2 / $roll2 / $A_st[$i];
			
			if ($R >= 1 && $R <= 5) {
			$Arr[$j] = $R;
			$C_D[$j] = sqrt($A_st[$i]*1000000/pi()*4); 
			$j++;
			} else {
				$error[$k] = $R;
				$k++;
			}
		}
	}

if ($k == 14) {
	return $k;
} else {
	return $C_D;
}

}
//通过C_D法兰口径查询版型型号
function platety($C_D)
{
	include("dbc.php");
	$sql = "SELECT * FROM `plate` WHERE `C_D`= '" . $C_D . "'";
	$rs = $db->query($sql);
	$row = $rs->fetch();
	if ($row) {
		print_r($row);
	} else {
		echo "查询为空";
	}
}
//查询流速在1到5之间的版型数据
function plate()
{

}
?>