<?php
/*
	热侧进口温度 -> T_1_i
	热侧出口温度 -> T_1_o
	热侧流量     -> W_1
	热侧压降     -> delta_p_1
	冷侧进口温度 -> T_2_i
	冷侧出口温度 -> T_2_o
	冷侧流量	 -> W_2
	冷侧压降	 -> delta_p_2
	热负荷       -> Q
 */
//判断参数是否有效
function input($T_1_i,$T_1_o,$W_1,$delta_p_1,$T_2_i,$T_2_o,$W_2,$delta_p_2,$Q)
{
	echo 
	"热侧进口温度" . $T_1_i . "<br>" . 
	"热侧出口温度" . $T_1_o . "<br>" . 
	"热侧流量" . $W_1 . "<br>" . 
	"热侧压降" . $delta_p_1 . "<br>" . 
	"冷侧进口温度" . $T_2_i . "<br>" . 
	"冷侧出口温度" . $T_2_o . "<br>" . 
	"冷侧流量" . $W_2 . "<br>" . 
	"冷侧压降" . $delta_p_2 . "<br>" . 
	"热负荷" . $Q . "<br>";
}
//计算管口流速Gp，查物性库和板型库，返回符合条件的板型型号
/*
function Gp()
{

}

function main()
{
    
}
 */
?>